app/controllers/clients_controller.rb

INSERT INTO "clients" ("nominative", "email", "via", "civico", "cap", "citta", "provincia", "stato", "numero", "partita_iva", "codice_fiscale", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save