app/controllers/performances_controller.rb

  def index
    @id_p = params[:id_p].to_s
    if (@id_p == "true")
      @performances = Performance.all.select{|x| !x.invoiced}
---
SELECT "performances".* FROM "performances"

  def create
    @performance = Performance.new(performance_params)

    respond_to do |format|
      if @performance.save
---
INSERT INTO "performances" ("client_id", "description", "date", "duration", "rate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_performance
      @performance = Performance.find(params[:id])
---
SELECT  "performances".* FROM "performances" WHERE "performances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]