app/controllers/rates_controller.rb

  def index
    @rates = Rate.all
---
SELECT "rates".* FROM "rates"

  def create
    @rate = Rate.new(rate_params)

    respond_to do |format|
      if @rate.save
---
INSERT INTO "rates" ("hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?)  [["hourly_rate", 8.5], ["created_at", "2017-11-14 22:09:15.299171"], ["updated_at", "2017-11-14 22:09:15.299171"]]

    def set_rate
      @rate = Rate.find(params[:id])
---
SELECT  "rates".* FROM "rates" WHERE "rates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]