app/views/performances/_form.html.erb

          <%= form.label :client_id , 'Select client'%>
          <%= form.select :client_id, options_for_select( Client.all.map{ |s| [s.nominative, s.id] }, selected: @performance.client_id ) , {include_blank: true} ,  {:class => 'pickers'} %>
---
SELECT "clients".* FROM "clients"

          <%= form.label :rate_id %>
          <%= form.select :rate_id, options_for_select( Rate.all.map{ |s| [s.hourly_rate, s.id] }, selected: @performance.rate_id ) , {include_blank: true}, {:class => 'pickers'}%>
---
SELECT "rates".* FROM "rates"